# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.


from sys import argv

name, work, work_hour, bonus = argv

work = int(work)
work_hour = int(work_hour)
bonus = int(bonus)

zarplata = int(work * work_hour + bonus)

print(zarplata)