# Реализовать функцию, принимающую несколько параметров,
# описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

def person(**kwargs):
    return kwargs

print(person(name="Denis", lastname="Efimov", byear="1989", city="Moscow"))


